Documents/ВедомостьНаПеречислениеВзносовОтчислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ВедомостьНаПеречислениеВзносовОтчислений</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНалогаВзносаОтчисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалоговВзносовОтчислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежейВГосБюджет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПоДокументу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежноеПоручениеНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежноеПоручениеДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыПлатежногоПоручения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаСуммКПеречислению</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗаполненияСуммКПеречислениюНалоговВзносовОтчислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Comment>ОснованиеПодписиГлавногоБухгалтера</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьГлавногоБухгалтера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиГлавногоБухгалтера</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьБухгалтера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиБухгалтера</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НалогиВзносыОтчисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцНалоговогоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалогВзнос</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегистрацияВНалоговомОргане</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключаетОПВ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключаетВОСМС</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключаетИПН</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключаетСО</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключаетООСМС</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключаетОПВР</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыНалоговВзносовОтчислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыНалоговВзносовОтчислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОППВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОСМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ООСМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПлатежейВГосБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыПлатежейВГосБюджет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Налог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогСам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогАкт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПениСам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПениАкт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/БанковскиеСчетаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчетаОрганизаций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторБанков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ВедомостьНаПеречислениеВзносовОтчислений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(НалогиВзносыОтчисления.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

Функция ПеречислятьПоМесяцуПериода(ПериодРегистрации, ВидНВО, ВидПлатежа, Организация) Экспорт
	
	// Организация, ПериодРегистрации 
	// настройки периода действия получаем на период заполнения документа
	// при расчете по периоду действия расчет ОСМС будет разноситься по месяцу действия события,
	// делить сумму ОСМС по периодам необходимости нет
	ИспользуетсяПериодДействия = Ложь;
	
	ПеречислятьПоМесяцуПериода = Ложь;

	Если ВидНВО = Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС
		ИЛИ ВидНВО = Перечисления.ВидыНалоговВзносовОтчислений.ООСМС Тогда
		
		Если ВидПлатежа = Перечисления.ВидыПлатежейВГосБюджет.Налог
			ИЛИ ВидПлатежа = Перечисления.ВидыПлатежейВГосБюджет.НалогАкт
			ИЛИ ВидПлатежа = Перечисления.ВидыПлатежейВГосБюджет.НалогСам Тогда
			
			Если ПериодРегистрации >= ЗарплатаКадрыБазовыйРК.ДатаИзмененияПорядкаПеречисленияОСМС2024() Тогда
				
				ПеречислятьПоМесяцуПериода = Истина;
				
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат ПеречислятьПоМесяцуПериода;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаДокумента.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.ВедомостьНаПеречислениеВзносовОтчислений;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Список перечислений
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик     = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.ВедомостьНаПеречислениеВзносовОтчислений";
	КомандаПечати.Идентификатор  = "ПФ_MXL_СписокПеречислений";
	КомандаПечати.Представление  = НСтр("ru = 'Список перечислений'");
	КомандаПечати.Порядок        = 1;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
    
   	// Заявление на возврат ошибочно уплаченных сумм единого платежа
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик     = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.ВедомостьНаПеречислениеВзносовОтчислений";
	КомандаПечати.Идентификатор  = "ПФ_MXL_ЗаявлениеНаВозвратЕдиногоПлатежа";
	КомандаПечати.Представление  = НСтр("ru = 'Заявление на возврат ошибочно уплаченных сумм единого платежа'");
	КомандаПечати.Порядок        = 1;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
   	// Заявление вкладчика о согласии списания ошибочно зачисленных сумм
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик     = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.ВедомостьНаПеречислениеВзносовОтчислений";
	КомандаПечати.Идентификатор  = "ПФ_MXL_ЗаявлениеОСогласииСписанияОшибочноЗачисленныхСумм";
	КомандаПечати.Представление  = НСтр("ru = 'Заявление вкладчика о согласии списания ошибочно зачисленных сумм'");
	КомандаПечати.Порядок        = 1;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Формирует печатные формы
//
// Параметры:
//  (входные)
//    МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//    ПараметрыПечати - Структура - дополнительные настройки печати;
//  (выходные)
//   КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы.
//   ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                             представление - имя области в которой был выведен объект;
//   ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_СписокПеречислений") Тогда
		ТабличныйДокумент = ПечатьСписокПеречислений(МассивОбъектов, ОбъектыПечати);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
															 "ПФ_MXL_СписокПеречислений", 
															 НСтр("ru = 'Список получателей'"), 
															 ТабличныйДокумент,,
															 "Документ.ВедомостьНаПеречислениеВзносовОтчислений.ПФ_MXL_СписокПеречислений");
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ЗаявлениеНаВозвратЕдиногоПлатежа") Тогда
		ТабличныйДокумент = ПечатьЗаявлениеНаВозвратЕдиногоПлатежа(МассивОбъектов, ОбъектыПечати);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
															 "ПФ_MXL_ЗаявлениеНаВозвратЕдиногоПлатежа", 
															 НСтр("ru = ''Заявление на возврат ошибочно уплаченных сумм единого платежа'"), 
															 ТабличныйДокумент,,
															 "Документ.ВедомостьНаПеречислениеВзносовОтчислений.ПФ_MXL_ЗаявлениеНаВозвратЕдиногоПлатежа");
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ЗаявлениеОСогласииСписанияОшибочноЗачисленныхСумм") Тогда
		ТабличныйДокумент = ПечатьЗаявлениеОСогласииСписанияОшибочноЗачисленныхСумм(МассивОбъектов, ОбъектыПечати);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
															 "ПФ_MXL_ЗаявлениеОСогласииСписанияОшибочноЗачисленныхСумм", 
															 НСтр("ru = 'Заявление вкладчика о согласии списания ошибочно зачисленных сумм'"), 
															 ТабличныйДокумент,,
															 "Документ.ВедомостьНаПеречислениеВзносовОтчислений.ПФ_MXL_ЗаявлениеОСогласииСписанияОшибочноЗачисленныхСумм");
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьСписокПеречислений(МассивОбъектов, ОбъектыПечати) Экспорт 
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВедомостьНаПеречислениеВзносовОтчислений_СписокПеречислений";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВедомостьНаПеречислениеВзносовОтчислений.ПФ_MXL_СписокПеречислений");
	
	// получаем данные для печати
	ВыборкаШапок = ВыборкаДляПечатиШапки(МассивОбъектов);
	ВыборкаСтрок = ВыборкаДляПечатиТаблицы(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	МассивВидовНВО = Новый Массив;
	МассивВидовНВО.Добавить("ОПВ");
	МассивВидовНВО.Добавить("ВОСМС");
	МассивВидовНВО.Добавить("СО");
	МассивВидовНВО.Добавить("ООСМС");
	МассивВидовНВО.Добавить("ОПВР");

	Пока ВыборкаШапок.Следующий() Цикл
		
		// Документы нужно выводить на разных страницах.
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Подсчитываем количество страниц документа - для корректного разбиения на страницы.
		ВсегоСтрокДокумента = ВыборкаСтрок.Количество();

		ЭтоЕП = ВыборкаШапок.ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ЕП");
		
		ОбластьМакетаШапкаДокумента = Макет.ПолучитьОбласть("ШапкаДокумента");
		ОбластьМакетаШапка			= Макет.ПолучитьОбласть("Шапка" + ?(ЭтоЕП, "ЕП", ""));
		ОбластьМакетаСтрока 		= Макет.ПолучитьОбласть("Строка" + ?(ЭтоЕП, "ЕП", ""));
		ОбластьМакетаИтогПоСтранице = Макет.ПолучитьОбласть("ИтогПоЛисту");
		ОбластьМакетаПодвал 		= Макет.ПолучитьОбласть("Подвал");
		
		// Массив с двумя строками - для разбиения на страницы.
	    ВыводимыеОбласти = Новый Массив();
		ВыводимыеОбласти.Добавить(ОбластьМакетаСтрока);
		ВыводимыеОбласти.Добавить(ОбластьМакетаИтогПоСтранице);
		
		// выводим данные о документе
		Если ВыборкаШапок.ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОПВ") Тогда
			ОбластьМакетаШапкаДокумента.Параметры.Наименование = НСтр("ru = 'Список на перечисление обязательных пенсионных взносов'");
		ИначеЕсли ВыборкаШапок.ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОППВ") Тогда
			ОбластьМакетаШапкаДокумента.Параметры.Наименование = НСтр("ru = 'Список на перечисление обязательных профессиональных пенсионных взносов'");
		ИначеЕсли ВыборкаШапок.ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.СО") Тогда
			ОбластьМакетаШапкаДокумента.Параметры.Наименование = НСтр("ru = 'Список на перечисление обязательных социальных отчислений'");
		ИначеЕсли ВыборкаШапок.ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ООСМС") Тогда
			ОбластьМакетаШапкаДокумента.Параметры.Наименование = НСтр("ru = 'Список на перечисление отчислений обязательного социального медицинского страхования'"); 
		ИначеЕсли ВыборкаШапок.ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ЕП") Тогда
			ОбластьМакетаШапкаДокумента.Параметры.Наименование = НСтр("ru = 'Список на перечисление единого платежа'"); 
		ИначеЕсли ВыборкаШапок.ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОПВР") Тогда
			ОбластьМакетаШапкаДокумента.Параметры.Наименование = НСтр("ru = 'Список на перечисление обязательных пенсионных взносов работодателя'"); 
		Иначе
			ОбластьМакетаШапкаДокумента.Параметры.Наименование = НСтр("ru = 'Список на перечисление взносов обязательного социального медицинского страхования'");
		КонецЕсли;
		
 		ОбластьМакетаШапкаДокумента.Параметры.ДатаДокумента = Формат(ВыборкаШапок.ДатаДокумента, "ДФ='дд ММММ гггг'");
 		ОбластьМакетаШапкаДокумента.Параметры.НомерДокумента = ВыборкаШапок.НомерДокумента;
 		ОбластьМакетаШапкаДокумента.Параметры.НазваниеОрганизации = СокрЛП(ВыборкаШапок.НазваниеОрганизации);
		ОбластьМакетаШапкаДокумента.Параметры.ИИНОрганизации = ВыборкаШапок.ИИНОрганизации;
		
		ТабличныйДокумент.Вывести(ОбластьМакетаШапкаДокумента);
		ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
		
		ВыведеноСтраниц = 1; ВыведеноСтрок = 0; ИтогоНаСтранице = 0; Итого = 0;
		// Выводим данные по строкам документа.
		НомерСтроки = 0;
		ВыборкаСтрок.Сбросить();
		Пока ВыборкаСтрок.НайтиСледующий(ВыборкаШапок.Ссылка, "Ведомость") Цикл
			
			НомерСтроки = НомерСтроки + 1;
			
			ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаСтрок);
			ОбластьМакетаСтрока.Параметры.НомерСтроки = НомерСтроки;
			ОбластьМакетаСтрока.Параметры.Физлицо = ВыборкаСтрок.Фамилия +" "+ ВыборкаСтрок.Имя +" "+ ВыборкаСтрок.Отчество;
			
			Если ЭтоЕП Тогда
				
				ДанныеКНПЕП = УчетНалоговВзносовОтчисленийРасширенныйКлиентСервер.ПолучитьТекстКНППлатежейДляЕП(ВыборкаСтрок, ВыборкаШапок.ВидПлатежа);
				
				ОбластьМакетаСтрока.Параметры.КНП = ДанныеКНПЕП.СписокКНП;
				
			КонецЕсли;
			
			// разбиение на страницы
			ВыведеноСтрок = ВыведеноСтрок + 1;
			
			// Проверим, уместится ли строка на странице или надо открывать новую страницу.
			ВывестиПодвалЛиста = Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабличныйДокумент, ВыводимыеОбласти);
			Если Не ВывестиПодвалЛиста И ВыведеноСтрок = ВсегоСтрокДокумента Тогда
				ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
				ВывестиПодвалЛиста = Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабличныйДокумент, ВыводимыеОбласти);
			КонецЕсли;
			Если ВывестиПодвалЛиста Тогда
				
				ОбластьМакетаИтогПоСтранице.Параметры.ИтогоНаСтранице = ИтогоНаСтранице;
				ТабличныйДокумент.Вывести(ОбластьМакетаИтогПоСтранице);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
				ВыведеноСтраниц = ВыведеноСтраниц + 1;
				ИтогоНаСтранице = 0;
				
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьМакетаСтрока);
			ИтогоНаСтранице = ИтогоНаСтранице + ВыборкаСтрок.Сумма;
			Итого = Итого + ВыборкаСтрок.Сумма;
			
		КонецЦикла;
		
		Если ВыведеноСтрок > 0 Тогда 
			ОбластьМакетаИтогПоСтранице.Параметры.ИтогоНаСтранице = ИтогоНаСтранице;
		КонецЕсли;
		
		ВыводимыеОбласти = Новый Массив();
		ВыводимыеОбласти.Добавить(ОбластьМакетаСтрока);
		ВыводимыеОбласти.Добавить(ОбластьМакетаИтогПоСтранице);
		ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
		Для Сч = 1 По ОбластьМакетаСтрока.Параметры.Количество() Цикл
			ОбластьМакетаСтрока.Параметры.Установить(Сч - 1,""); 
		КонецЦикла;
		ОбластьМакетаСтрока.Параметры.Физлицо = " ";
		Пока ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабличныйДокумент, ВыводимыеОбласти) Цикл
			ТабличныйДокумент.Вывести(ОбластьМакетаСтрока);
		КонецЦикла;
		
		ТабличныйДокумент.Вывести(ОбластьМакетаИтогПоСтранице);
		
		ОбластьМакетаПодвал.Параметры.Заполнить(ВыборкаШапок);
		ОбластьМакетаПодвал.Параметры.Итого = Итого;
		
		ВалютаУчета = ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты();
		СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(Итого, ВалютаУчета);
		ОбластьМакетаПодвал.Параметры.СуммаПрописью = СуммаПрописью;
		ОбластьМакетаПодвал.Параметры.КоличествоСтрок = НомерСтроки;
		
		ТабличныйДокумент.Вывести(ОбластьМакетаПодвал);
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапок.Ссылка);
		
	КонецЦикла; // по документам
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьЗаявлениеНаВозвратЕдиногоПлатежа(МассивОбъектов, ОбъектыПечати) Экспорт 
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВедомостьНаПеречислениеВзносовОтчислений_ЗаявлениеНаВозвратЕдиногоПлатежа";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВедомостьНаПеречислениеВзносовОтчислений.ПФ_MXL_ЗаявлениеНаВозвратЕдиногоПлатежа");
	
	// получаем данные для печати
	ВыборкаШапок = ВыборкаДляПечатиШапкиЗаявленияНаВозвратЕдиногоПлатежа(МассивОбъектов);
	ВыборкаСтрок = ВыборкаДляПечатиТаблицы(МассивОбъектов);
    
    ПервыйДокумент = Истина;
    
    Пока ВыборкаШапок.Следующий() Цикл
        
        Если  ВыборкаШапок.ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ЕП") Тогда
            
            // Документы нужно выводить на разных страницах.
            Если Не ПервыйДокумент Тогда
                ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
            КонецЕсли;
            ПервыйДокумент = Ложь;
            
            // Запомним номер строки, с которой начали выводить текущий документ.
            НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
            
            // Подсчитываем количество страниц документа - для корректного разбиения на страницы.
            ВсегоСтрокДокумента = ВыборкаСтрок.Количество();
                        
            ОбластьМакетаШапкаДокумента = Макет.ПолучитьОбласть("Шапка");
            ОбластьМакетаСтрока 		= Макет.ПолучитьОбласть("Строка");
            ОбластьМакетаПодвал 		= Макет.ПолучитьОбласть("Подвал");
            ОбластьМакетаПодвал2		= Макет.ПолучитьОбласть("Подвал2");
            ОбластьМакетаПодвал3		= Макет.ПолучитьОбласть("Подвал3");
            
            // Массив с двумя строками - для разбиения на страницы.
            ВыводимыеОбласти = Новый Массив();
            ВыводимыеОбласти.Добавить(ОбластьМакетаСтрока);
            
            СтрокаСведений = "ПолныйАдрЮР, ТелОрганизации, АдресЭлектроннойПочтыОрганизации";
            СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(ВыборкаШапок.Организация,,СтрокаСведений);
            
            ОбластьМакетаШапкаДокумента.Параметры.Получатель =  СокрЛП(ВыборкаШапок.Получатель);
            ОбластьМакетаШапкаДокумента.Параметры.ДатаПлатежа = Формат(ВыборкаШапок.ДатаПлатежа, "ДФ='дд ММММ гггг'");
            ОбластьМакетаШапкаДокумента.Параметры.НомерПлатежа = ВыборкаШапок.НомерПлатежа;
            ОбластьМакетаШапкаДокумента.Параметры.НазваниеОрганизации = СокрЛП(ВыборкаШапок.НазваниеОрганизации);
            ОбластьМакетаШапкаДокумента.Параметры.НазваниеОрганизации = СокрЛП(ВыборкаШапок.НазваниеОрганизации);
            ОбластьМакетаШапкаДокумента.Параметры.Сумма = ВыборкаШапок.СуммаПоДокументу;
            
            ТабличныйДокумент.Вывести(ОбластьМакетаШапкаДокумента);
 
            ВыведеноСтраниц = 1; 
            ВыведеноСтрок = 0;
            // Выводим данные по строкам документа.
            НомерСтроки = 0;
            ВыборкаСтрок.Сбросить();
            Пока ВыборкаСтрок.НайтиСледующий(ВыборкаШапок.Ссылка, "Ведомость") Цикл
                
                НомерСтроки = НомерСтроки + 1;
                
                ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаСтрок);
                ОбластьМакетаСтрока.Параметры.НомерСтроки = НомерСтроки;
                ОбластьМакетаСтрока.Параметры.Физлицо = ВыборкаСтрок.Фамилия +" "+ ВыборкаСтрок.Имя +" "+ ВыборкаСтрок.Отчество;
                ОбластьМакетаСтрока.Параметры.Период = ВыборкаСтрок.ПериодПлатежа;
                ОбластьМакетаСтрока.Параметры.Сумма = ВыборкаСтрок.Сумма;
                ОбластьМакетаСтрока.Параметры.СуммаВозврата = ВыборкаСтрок.Сумма;
                              
                // разбиение на страницы
                ВыведеноСтрок = ВыведеноСтрок + 1;
                
                // Проверим, уместится ли строка на странице или надо открывать новую страницу.
                ВывестиПодвалЛиста = Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабличныйДокумент, ВыводимыеОбласти);
                Если Не ВывестиПодвалЛиста И ВыведеноСтрок = ВсегоСтрокДокумента Тогда
                    ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
                    ВывестиПодвалЛиста = Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабличныйДокумент, ВыводимыеОбласти);
                КонецЕсли;
                Если ВывестиПодвалЛиста Тогда
                    ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
                    ВыведеноСтраниц = ВыведеноСтраниц + 1;
                КонецЕсли;
                
                ТабличныйДокумент.Вывести(ОбластьМакетаСтрока);
                
            КонецЦикла;
            
            ВыводимыеОбласти = Новый Массив();
            ВыводимыеОбласти.Добавить(ОбластьМакетаСтрока);
            ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
            Для Сч = 1 По ОбластьМакетаСтрока.Параметры.Количество() Цикл
                ОбластьМакетаСтрока.Параметры.Установить(Сч - 1,""); 
            КонецЦикла;
            ОбластьМакетаСтрока.Параметры.Физлицо = " ";
            Пока ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабличныйДокумент, ВыводимыеОбласти) Цикл
                ТабличныйДокумент.Вывести(ОбластьМакетаСтрока);
            КонецЦикла;
             
            
            ТабличныйДокумент.Вывести(ОбластьМакетаПодвал);
            
            ОбластьМакетаПодвал2.Параметры.НазваниеОрганизации = СокрЛП(ВыборкаШапок.НазваниеОрганизации);
            ОбластьМакетаПодвал2.Параметры.ИИНОрганизации = ВыборкаШапок.ИИНОрганизации;


            СтруктураРеквизитовБанковскогоСчета = Справочники.БанковскиеСчетаОрганизаций.ПолучитьРеквизитыБанковскогоСчетаОрганизации(ВыборкаШапок.НомерСчета);
            ОбластьМакетаПодвал2.Параметры.БИКБанка = СтруктураРеквизитовБанковскогоСчета.БИК;
            ОбластьМакетаПодвал2.Параметры.Банк = СтруктураРеквизитовБанковскогоСчета.Банк;
            ОбластьМакетаПодвал2.Параметры.НомерСчета = СтруктураРеквизитовБанковскогоСчета.НомерСчета;
            
            ТабличныйДокумент.Вывести(ОбластьМакетаПодвал2);
            
            ОбластьМакетаПодвал3.Параметры.Заполнить(ВыборкаШапок);
            ОбластьМакетаПодвал3.Параметры.ЮридическийАдрес = СведенияОбОрганизации.ПолныйАдрЮР;
            ОбластьМакетаПодвал3.Параметры.Телефон = СведенияОбОрганизации.ТелОрганизации;
            ОбластьМакетаПодвал3.Параметры.АдресЭлектроннойПочты = СведенияОбОрганизации.АдресЭлектроннойПочтыОрганизации;
            
            ТабличныйДокумент.Вывести(ОбластьМакетаПодвал3);
            
            // В табличном документе необходимо задать имя области, в которую был 
            // выведен объект. Нужно для возможности печати покомплектно.
            УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапок.Ссылка);
        КонецЕсли;
    КонецЦикла; // по документам
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьЗаявлениеОСогласииСписанияОшибочноЗачисленныхСумм(МассивОбъектов, ОбъектыПечати) Экспорт 
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВедомостьНаПеречислениеВзносовОтчислений_ЗаявлениеОСогласииСписанияОшибочноЗачисленныхСумм";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВедомостьНаПеречислениеВзносовОтчислений.ПФ_MXL_ЗаявлениеОСогласииСписанияОшибочноЗачисленныхСумм");
	
	// получаем данные для печати
	ВыборкаШапок = ВыборкаДляПечатиШапкиЗаявленияНаВозвратЕдиногоПлатежа(МассивОбъектов);
	ВыборкаСтрок = ВыборкаДляПечатиТаблицы(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
    Пока ВыборкаШапок.Следующий() Цикл
        Если  ВыборкаШапок.ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ЕП") Тогда
            Пока ВыборкаСтрок.НайтиСледующий(ВыборкаШапок.Ссылка, "Ведомость") Цикл
                
                // Документы нужно выводить на разных страницах.
                Если Не ПервыйДокумент Тогда
                    ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
                КонецЕсли;
                ПервыйДокумент = Ложь;
                
                // Запомним номер строки, с которой начали выводить текущий документ.
                НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
                
                // Подсчитываем количество страниц документа - для корректного разбиения на страницы.
                ВсегоСтрокДокумента = ВыборкаСтрок.Количество();
                
                ОбластьМакетаШапкаДокумента = Макет.ПолучитьОбласть("Шапка");
                
                ОбластьМакетаШапкаДокумента.Параметры.Физлицо = ВыборкаСтрок.Фамилия +" "+ ВыборкаСтрок.Имя +" "+ ВыборкаСтрок.Отчество;
                ОбластьМакетаШапкаДокумента.Параметры.ДатаРождения =  Формат(ВыборкаСтрок.ДатаРождения, "ДФ=dd.MM.yyyy");
                ОбластьМакетаШапкаДокумента.Параметры.ИИН = ВыборкаСтрок.ИИН;
                ВалютаУчета = ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты();
                СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ВыборкаСтрок.Сумма, ВалютаУчета);
                
                ОбластьМакетаШапкаДокумента.Параметры.СуммаПрописью = СуммаПрописью;
                ТабличныйДокумент.Вывести(ОбластьМакетаШапкаДокумента);
                
                // В табличном документе необходимо задать имя области, в которую был 
                // выведен объект. Нужно для возможности печати покомплектно.
                УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапок.Ссылка);
            КонецЦикла;
        КонецЕсли;
    КонецЦикла; // по документам
    
    Возврат ТабличныйДокумент;
	
КонецФункции

// Формирует запрос по документу.
//
// Параметры: 
//  Ведомости - массив ДокументСсылка.ВедомостьНаПеречислениеВзносовОтчислений.
//
// Возвращаемое значение:
//  Результат запроса
//
Функция ВыборкаДляПечатиШапки(Ведомости) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Установим параметры запроса.
	Запрос.УстановитьПараметр("Ведомости", Ведомости);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ведомость.Ссылка,
	|	Ведомость.Номер КАК Номер,
	|	Ведомость.Дата КАК Дата,
	|	Ведомость.ПериодРегистрации КАК ПериодРегистрации,
	|	Ведомость.Организация КАК Организация,
	|	ВЫРАЗИТЬ(Ведомость.Организация.НаименованиеПолное КАК СТРОКА(300)) КАК НазваниеОрганизации,
	|	Ведомость.Подразделение КАК Подразделение,
	|	Ведомость.СуммаПоДокументу КАК СуммаПоДокументу,
	|	Ведомость.Руководитель,
	|	Ведомость.ДолжностьРуководителя.Наименование КАК РуководительДолжность,
	|	Ведомость.ГлавныйБухгалтер,
	|	Ведомость.Бухгалтер,
	|	Ведомость.ВидНалогаВзносаОтчисления,
	|	Ведомость.ВидПлатежа,
	|	Ведомость.Организация.ИНН КАК ИИНОрганизации
	|ПОМЕСТИТЬ ВТДанныеДокументов
	|ИЗ
	|	Документ.ВедомостьНаПеречислениеВзносовОтчислений КАК Ведомость
	|ГДЕ
	|	Ведомость.Ссылка В(&Ведомости)
	|";
	
	Запрос.Выполнить();
	
	ИменаПолейОтветственныхЛиц = Новый Массив;
	ИменаПолейОтветственныхЛиц.Добавить("Руководитель");
	ИменаПолейОтветственныхЛиц.Добавить("ГлавныйБухгалтер");
	ИменаПолейОтветственныхЛиц.Добавить("Бухгалтер");
	
	ЗарплатаКадры.СоздатьВТФИООтветственныхЛиц(Запрос.МенеджерВременныхТаблиц, Истина, ИменаПолейОтветственныхЛиц, "ВТДанныеДокументов");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка,
	|	ДанныеДокументов.Номер КАК НомерДокумента,
	|	ДанныеДокументов.Дата КАК ДатаДокумента,
	|	ДанныеДокументов.ПериодРегистрации,
	|	ДанныеДокументов.Организация,
	|	ДанныеДокументов.ИИНОрганизации КАК ИИНОрганизации,
	|	ДанныеДокументов.НазваниеОрганизации,
	|	ДанныеДокументов.Подразделение,
	|	ДанныеДокументов.СуммаПоДокументу,
	|	ЕСТЬNULL(ФИОРуководителя.РасшифровкаПодписи, """") КАК Руководитель,
	|	ДанныеДокументов.РуководительДолжность,
	|	ЕСТЬNULL(ФИОГлавногоБухгалтера.РасшифровкаПодписи, """") КАК ГлавныйБухгалтер,
	|	ЕСТЬNULL(ФИОБухгалтера.РасшифровкаПодписи, """") КАК Бухгалтер,
	|	ДанныеДокументов.ВидНалогаВзносаОтчисления,
	|	ДанныеДокументов.ВидПлатежа
	|ИЗ
	|	ВТДанныеДокументов КАК ДанныеДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИОРуководителя
	|		ПО ДанныеДокументов.Ссылка = ФИОРуководителя.Ссылка
	|			И ДанныеДокументов.Руководитель = ФИОРуководителя.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИОГлавногоБухгалтера
	|		ПО ДанныеДокументов.Ссылка = ФИОГлавногоБухгалтера.Ссылка
	|			И ДанныеДокументов.ГлавныйБухгалтер = ФИОГлавногоБухгалтера.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИОБухгалтера
	|		ПО ДанныеДокументов.Ссылка = ФИОБухгалтера.Ссылка
	|			И ДанныеДокументов.Бухгалтер = ФИОБухгалтера.ФизическоеЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокументов.Дата,
	|	ДанныеДокументов.Номер";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

// Формирует запрос по документу.
//
// Параметры: 
//  Ведомости - массив ДокументСсылка.ВедомостьНаПеречислениеВзносовОтчислений.
//
// Возвращаемое значение:
//  Результат запроса
//
Функция ВыборкаДляПечатиШапкиЗаявленияНаВозвратЕдиногоПлатежа(Ведомости) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВнешниеХозяйственныеОперацииЗарплатаКадры") Тогда 
		
		Документ = "ПеречислениеВзносовИОтчислений";
		ТабличнаяЧасть = "ВедомостиНаПеречислениеВзносовИОтчислений";
		
	Иначе
		
		Документ = "СписаниеБезналичныхДенежныхСредств";
		ТабличнаяЧасть = "РасшифровкаПлатежа";
		
	КонецЕсли;

	// Установим параметры запроса.
	Запрос.УстановитьПараметр("Ведомости", Ведомости);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ведомость.Ссылка,
	|	Ведомость.Номер КАК Номер,
	|	Ведомость.Дата КАК Дата,
	|	Ведомость.ПериодРегистрации КАК ПериодРегистрации,
	|	Ведомость.Организация КАК Организация,
	|	ВЫРАЗИТЬ(Ведомость.Организация.НаименованиеПолное КАК СТРОКА(300)) КАК НазваниеОрганизации,
	|	Ведомость.Подразделение КАК Подразделение,
	|	Ведомость.СуммаПоДокументу КАК СуммаПоДокументу,
	|	Ведомость.Руководитель,
	|	Ведомость.ДолжностьРуководителя.Наименование КАК РуководительДолжность,
	|	Ведомость.ГлавныйБухгалтер,
	|	Ведомость.Бухгалтер,
	|	Ведомость.ВидНалогаВзносаОтчисления,
	|	Ведомость.ВидПлатежа,
	|	Ведомость.Организация.ИНН КАК ИИНОрганизации
	|ПОМЕСТИТЬ ВТДанныеДокументов
	|ИЗ
	|	Документ.ВедомостьНаПеречислениеВзносовОтчислений КАК Ведомость
	|ГДЕ
	|	Ведомость.Ссылка В(&Ведомости)
	|";
	
	Запрос.Выполнить();
	
	ИменаПолейОтветственныхЛиц = Новый Массив;
	ИменаПолейОтветственныхЛиц.Добавить("Руководитель");
	ИменаПолейОтветственныхЛиц.Добавить("ГлавныйБухгалтер");
	ИменаПолейОтветственныхЛиц.Добавить("Бухгалтер");
	
	ЗарплатаКадры.СоздатьВТФИООтветственныхЛиц(Запрос.МенеджерВременныхТаблиц, Истина, ИменаПолейОтветственныхЛиц, "ВТДанныеДокументов");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка,
	|	ДанныеДокументов.Номер КАК НомерДокумента,
	|	ДанныеДокументов.Дата КАК ДатаДокумента,
	|	ДанныеДокументов.ПериодРегистрации,
	|	ДанныеДокументов.Организация,
	|	ДанныеДокументов.ИИНОрганизации КАК ИИНОрганизации,
	|	ДанныеДокументов.НазваниеОрганизации,
	|	ДанныеДокументов.Подразделение,
	|	ДанныеДокументов.СуммаПоДокументу,
	|	ЕСТЬNULL(ФИОРуководителя.РасшифровкаПодписи, """") КАК Руководитель,
	|	ДанныеДокументов.РуководительДолжность,
	|	ЕСТЬNULL(ФИОГлавногоБухгалтера.РасшифровкаПодписи, """") КАК ГлавныйБухгалтер,
	|	ДанныеДокументов.ВидНалогаВзносаОтчисления,
	|	ДанныеДокументов.ВидПлатежа,
    |   ОплатаВедомостей.БанковскийСчет КАК НомерСчета,
    |   ОплатаВедомостей.Дата КАК ДатаПлатежа,
    |   ОплатаВедомостей.Номер КАК НомерПлатежа,
    |   ВЫРАЗИТЬ(ОплатаВедомостей.Контрагент.НаименованиеПолное КАК СТРОКА (300)) КАК Получатель
	|ИЗ
	|	ВТДанныеДокументов КАК ДанныеДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИОРуководителя
	|		ПО ДанныеДокументов.Ссылка = ФИОРуководителя.Ссылка
	|			И ДанныеДокументов.Руководитель = ФИОРуководителя.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИОГлавногоБухгалтера
	|		ПО ДанныеДокументов.Ссылка = ФИОГлавногоБухгалтера.Ссылка
	|			И ДанныеДокументов.ГлавныйБухгалтер = ФИОГлавногоБухгалтера.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИОБухгалтера
	|		ПО ДанныеДокументов.Ссылка = ФИОБухгалтера.Ссылка
	|			И ДанныеДокументов.Бухгалтер = ФИОБухгалтера.ФизическоеЛицо
   	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ." + Документ + "." + ТабличнаяЧасть + " КАК ТЧОплатаВедомостей
    |       ПО  ДанныеДокументов.Ссылка = ТЧОплатаВедомостей.Ведомость
   	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ." + Документ + " КАК ОплатаВедомостей
	|	    ПО ОплатаВедомостей.Ссылка = ТЧОплатаВедомостей.Ссылка
    |           И ОплатаВедомостей.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокументов.Дата,
	|	ДанныеДокументов.Номер";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

// Формирует запрос по табличной части документа.
//
// Параметры: 
//  Ведомости - массив ДокументСсылка.ВедомостьНаПеречислениеВзносовОтчислений.
//
// Возвращаемое значение:
//  Выборка из результата запроса.
//
Функция ВыборкаДляПечатиТаблицы(Ведомости) Экспорт

	Запрос = Новый Запрос;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.УстановитьПараметр("Ведомости", Ведомости);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЧНалогиВзносыОтчисления.Ссылка КАК Ссылка,
	|	ТЧНалогиВзносыОтчисления.НомерСтроки,
	|	ТЧНалогиВзносыОтчисления.Ссылка.Дата КАК Период,
	|	ТЧНалогиВзносыОтчисления.ФизическоеЛицо,
	|	ТЧНалогиВзносыОтчисления.ФизическоеЛицо.ДатаРождения КАК ДатаРождения,
	|	СУММА(ТЧНалогиВзносыОтчисления.НалогВзнос) КАК Сумма,
	|	СУММА(ТЧНалогиВзносыОтчисления.СуммаПлатежа) КАК СуммаПлатежа,
	|	ВЫБОР
	|		КОГДА ТЧНалогиВзносыОтчисления.МесяцПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ТЧНалогиВзносыОтчисления.МесяцНалоговогоПериода
	|		ИНАЧЕ ТЧНалогиВзносыОтчисления.МесяцПериода
	|	КОНЕЦ КАК ПериодПлатежа,
	|	ТЧНалогиВзносыОтчисления.ФизическоеЛицо.ИНН КАК ИИН,
	|	МАКСИМУМ(ТЧНалогиВзносыОтчисления.ВключаетОПВ) КАК ОПВ,
	|	МАКСИМУМ(ТЧНалогиВзносыОтчисления.ВключаетВОСМС) КАК ВОСМС,
	|	МАКСИМУМ(ТЧНалогиВзносыОтчисления.ВключаетИПН) КАК ИПН,
	|	МАКСИМУМ(ТЧНалогиВзносыОтчисления.ВключаетСО) КАК СО,
	|	МАКСИМУМ(ТЧНалогиВзносыОтчисления.ВключаетООСМС) КАК ООСМС,
	|	МАКСИМУМ(ТЧНалогиВзносыОтчисления.ВключаетОПВР) КАК ОПВР
	|ПОМЕСТИТЬ ВТСписокФизическихЛиц
	|ИЗ
	|	Документ.ВедомостьНаПеречислениеВзносовОтчислений.НалогиВзносыОтчисления КАК ТЧНалогиВзносыОтчисления
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВедомостьНаПеречислениеВзносовОтчислений КАК ВедомостьНаПеречислениеВзносовОтчислений
	|	ПО ВедомостьНаПеречислениеВзносовОтчислений.Ссылка = ТЧНалогиВзносыОтчисления.Ссылка
	|ГДЕ
	|	ТЧНалогиВзносыОтчисления.Ссылка В(&Ведомости)
	|	И ТЧНалогиВзносыОтчисления.НалогВзнос > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧНалогиВзносыОтчисления.Ссылка,
	|	ТЧНалогиВзносыОтчисления.Ссылка.Дата,
	|	ТЧНалогиВзносыОтчисления.ФизическоеЛицо,
	|	ТЧНалогиВзносыОтчисления.ФизическоеЛицо.ДатаРождения,
	|	ВЫБОР
	|		КОГДА ТЧНалогиВзносыОтчисления.МесяцПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ТЧНалогиВзносыОтчисления.МесяцНалоговогоПериода
	|		ИНАЧЕ ТЧНалогиВзносыОтчисления.МесяцПериода
	|	КОНЕЦ,
	|	ТЧНалогиВзносыОтчисления.ФизическоеЛицо.ИНН,
	|	ТЧНалогиВзносыОтчисления.НомерСтроки";
	
	Запрос.Выполнить();
	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(Запрос.МенеджерВременныхТаблиц, "ВТСписокФизическихЛиц");
	КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(ОписательВременныхТаблиц, Истина, "Фамилия,Имя,Отчество");

	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокФизическихЛиц.Ссылка КАК Ведомость,
	|	СписокФизическихЛиц.НомерСтроки,
	|	СписокФизическихЛиц.ДатаРождения КАК ДатаРождения,
	|	СписокФизическихЛиц.ИИН КАК ИИН,
	|	СписокФизическихЛиц.ПериодПлатежа КАК ПериодПлатежа,
	|	КадровыеДанныеФизическихЛиц.Фамилия,
	|	КадровыеДанныеФизическихЛиц.Имя,
	|	КадровыеДанныеФизическихЛиц.Отчество,
	|	СписокФизическихЛиц.Сумма КАК Сумма,	
	|	СписокФизическихЛиц.СуммаПлатежа КАК СуммаПлатежа,
	|	СписокФизическихЛиц.ОПВ КАК ОПВ,
	|	СписокФизическихЛиц.ВОСМС КАК ВОСМС,
	|	СписокФизическихЛиц.ИПН КАК ИПН,
	|	СписокФизическихЛиц.СО КАК СО,
	|	СписокФизическихЛиц.ООСМС КАК ООСМС,
	|	СписокФизическихЛиц.ОПВР КАК ОПВР
	|ИЗ
	|	ВТСписокФизическихЛиц КАК СписокФизическихЛиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизическихЛиц
	|		ПО СписокФизическихЛиц.ФизическоеЛицо = КадровыеДанныеФизическихЛиц.ФизическоеЛицо
	|			И СписокФизическихЛиц.Период = КадровыеДанныеФизическихЛиц.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	КадровыеДанныеФизическихЛиц.Фамилия,
	|	КадровыеДанныеФизическихЛиц.Имя,
	|	СписокФизическихЛиц.ПериодПлатежа";

	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

#КонецОбласти

Функция РеквизитыОтветственныхЛиц() Экспорт
	
	РеквизитыОтветственныхЛиц = Новый Массив;
	
	РеквизитыОтветственныхЛиц.Добавить("Руководитель");
	РеквизитыОтветственныхЛиц.Добавить("ДолжностьРуководителя");
	РеквизитыОтветственныхЛиц.Добавить("ГлавныйБухгалтер");
	РеквизитыОтветственныхЛиц.Добавить("ДолжностьГлавногоБухгалтера");
	РеквизитыОтветственныхЛиц.Добавить("Бухгалтер");
	РеквизитыОтветственныхЛиц.Добавить("ДолжностьБухгалтера");
	
	Возврат РеквизитыОтветственныхЛиц
	
КонецФункции	

#КонецОбласти

#КонецЕсли
